app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @lists = List.all

INSERT INTO "lists" ("nombre", "curso", "asignatura", "calificacion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "paola"], ["curso", "Tech"], ["asignatura", "redes"], ["calificacion", "5"], ["created_at", "2018-01-11 17:54:13.674323"], ["updated_at", "2018-01-11 17:54:13.674323"]]
---
  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_list
      @list = List.find(params[:id])